
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/18213184246)



<pre><code>Apply complete! Resources: 0 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.http.my_file: Reading...
cloudflare_zero_trust_access_tag.tags["wan"]: Refreshing state... [id=wan]
cloudflare_zero_trust_access_tag.tags["iot"]: Refreshing state... [id=iot]
cloudflare_zero_trust_access_tag.tags["wifi"]: Refreshing state... [id=wifi]
cloudflare_zone.xvx_cz: Refreshing state... [id=b84174cc7be41b21a9c36d62aff39e84]
cloudflare_zero_trust_access_tag.tags["router"]: Refreshing state... [id=router]
cloudflare_zone.ruzicka_dev: Refreshing state... [id=452e45a673326608122e759793a713f3]
cloudflare_zero_trust_access_policy.google_sso_access: Refreshing state... [id=9a0319bc-fae3-45ef-b6e9-375a9e8c2d42]
cloudflare_zone.mylabs_dev: Refreshing state... [id=2859c4d6f599a36a424765646b79904e]
cloudflare_pages_project.ruzickap_github_io: Refreshing state... [id=ruzickap-github-io]
data.http.my_file: Read complete after 1s [id=https://uptimerobot.com/inc/files/ips/IPv4andIPv6.txt]
cloudflare_zero_trust_access_tag.tags["lan"]: Refreshing state... [id=lan]
cloudflare_zero_trust_access_tag.tags["container"]: Refreshing state... [id=container]
cloudflare_zero_trust_access_tag.tags["rpi"]: Refreshing state... [id=rpi]
cloudflare_zero_trust_access_policy.allow_all: Refreshing state... [id=d500f04e-d4dd-43b3-bf27-095e33951016]
cloudflare_zero_trust_access_identity_provider.google_oauth: Refreshing state... [id=8db5bd37-fc86-4df0-a736-0d6536e52342]
cloudflare_dns_record.xvx_cz_txt_records["google-site-verification"]: Refreshing state... [id=f4cb1081d97b226cfd77759acd261bc3]
cloudflare_dns_record.xvx_cz_txt_records["spf"]: Refreshing state... [id=e4a53ad27330858a4662ba0353f013d4]
cloudflare_dns_record.xvx_cz_txt_records["google._domainkey"]: Refreshing state... [id=8d5891b154fe58954c7ed81f9eec0b44]
cloudflare_dns_record.xvx_cz_txt_records["_acme-challenge.auth.infra"]: Refreshing state... [id=3d8b58883f7838e4a80d8831e7bf3542]
cloudflare_dns_record.xvx_cz_txt_records["_dmarc"]: Refreshing state... [id=d8def72bb968b75a34aa7518ee320eca]
cloudflare_dns_record.xvx_cz_a_records["gate-bracha"]: Refreshing state... [id=ea0d0eca312ff9b1fd3369b009cea75d]
cloudflare_dns_record.xvx_cz_a_records["raspi"]: Refreshing state... [id=fd9bc56293f101b8931caab1fad1e937]
cloudflare_dns_record.xvx_cz_a_records["stats"]: Refreshing state... [id=283a6086cbaa599b0a7ac7c5271c77c4]
cloudflare_dns_record.xvx_cz_mx_records["mx2"]: Refreshing state... [id=31d1b596145f6db7832aedfd7d2c62b3]
cloudflare_dns_record.xvx_cz_mx_records["mx4"]: Refreshing state... [id=d2386dc5233bee19b1113205a8b878be]
cloudflare_dns_record.xvx_cz_mx_records["mx3"]: Refreshing state... [id=152ae97d4116705bb91f024c15d58250]
cloudflare_dns_record.xvx_cz_mx_records["mx5"]: Refreshing state... [id=9484a175fa7be245096129a26799d1bb]
cloudflare_dns_record.xvx_cz_mx_records["mx1"]: Refreshing state... [id=aef758158c1f01b0bcad32d9adb16a24]
cloudflare_dns_record.xvx_cz_cname_records["linux"]: Refreshing state... [id=f268f6cacf41248bc136e7b4c54c3560]
cloudflare_dns_record.xvx_cz_cname_records[""]: Refreshing state... [id=639b9f34ce5af27fb4469e82153278c5]
cloudflare_dns_record.xvx_cz_cname_records["ruzickovabozena"]: Refreshing state... [id=6e5a45118f97c129a9461c13fcd18c8b]
cloudflare_dns_record.xvx_cz_cname_records["www.svatba"]: Refreshing state... [id=b6821c7dd6a57fa6ced05d9ba7220bf6]
cloudflare_dns_record.xvx_cz_cname_records["linux-old"]: Refreshing state... [id=761426aec70b86a8d8b7da3639a4c0aa]
cloudflare_dns_record.xvx_cz_cname_records["www.linux"]: Refreshing state... [id=710ca1eb4e3dbbc6595c311e35fa7dca]
cloudflare_dns_record.xvx_cz_cname_records["petr"]: Refreshing state... [id=3746244dad10053fdff7ccc3966cea22]
cloudflare_dns_record.xvx_cz_cname_records["www"]: Refreshing state... [id=68125f52c72735ef84ef928047067600]
cloudflare_dns_record.xvx_cz_cname_records["byt"]: Refreshing state... [id=f8503f7e872d19bea7e343d1387e3607]
cloudflare_dns_record.xvx_cz_cname_records["svatba"]: Refreshing state... [id=2a82a4e0e9a03abb028248bb8a9d48f8]
cloudflare_dns_record.xvx_cz_cname_records["www.linux-old"]: Refreshing state... [id=91fc6a11efcf4747eba0af2ce289e323]
cloudflare_dns_record.xvx_cz_cname_records["www.ruzickovabozena"]: Refreshing state... [id=10d8f0bd9f189c6fab3296e8f4304d4a]
cloudflare_dns_record.xvx_cz_cname_records["cestovani"]: Refreshing state... [id=2071b139d06452a796ea0c6c90e01164]
cloudflare_dns_record.ruzicka_dev_txt_records["_github-pages-challenge-ruzickap"]: Refreshing state... [id=d2f971283bde7545bed03092f7ebe829]
cloudflare_dns_record.ruzicka_dev_txt_records["cf2024-1._domainkey"]: Refreshing state... [id=b57d74c4207949419eed79426a79ada8]
cloudflare_dns_record.ruzicka_dev_txt_records["spf"]: Refreshing state... [id=7ad39b456f39cd4be7a205f3d3d01b2b]
cloudflare_dns_record.ruzicka_dev_cname_records["petr"]: Refreshing state... [id=456b097c1b2d2a34c6c7fc3f19a59591]
cloudflare_dns_record.ruzicka_dev_mx_records["mx2"]: Refreshing state... [id=8d67179c9212557957737b8fb3163884]
cloudflare_dns_record.ruzicka_dev_cname_records["stats-ruzickap-github-io"]: Refreshing state... [id=9696a13789327d4373b531b53042f3f4]
cloudflare_dns_record.ruzicka_dev_cname_records["www"]: Refreshing state... [id=a602a9c5d645e5af3f7cc0493d15e9c2]
cloudflare_dns_record.ruzicka_dev_cname_records[""]: Refreshing state... [id=0c0595ee5430c463256108f8007820fb]
cloudflare_dns_record.ruzicka_dev_cname_records["blog"]: Refreshing state... [id=eeadc206b3e14c83680571637410ed35]
cloudflare_dns_record.ruzicka_dev_mx_records["mx3"]: Refreshing state... [id=9dc1445c559cb8faab9edb95d3cbe182]
cloudflare_dns_record.ruzicka_dev_mx_records["mx1"]: Refreshing state... [id=d0e76697bef0cc42a3bda321c6718b00]
cloudflare_dns_record.mylabs_dev_ns_records["k8s-ns1"]: Refreshing state... [id=28eb402b83cb40a28fa81b8dd9b584b9]
cloudflare_dns_record.mylabs_dev_ns_records["aws-ns1"]: Refreshing state... [id=6306fda43c4e0f13223b20bdadbfa4e1]
cloudflare_dns_record.mylabs_dev_cname_records["www"]: Refreshing state... [id=3f9503e08e744196ca8f43a6737ff371]
cloudflare_dns_record.mylabs_dev_ns_records["aws-ns4"]: Refreshing state... [id=e6da3be1f495c2948d2fffdb1d7f828d]
cloudflare_dns_record.mylabs_dev_ns_records["k8s-ns2"]: Refreshing state... [id=237d02eb6ae689d84f9668b671598616]
cloudflare_dns_record.mylabs_dev_ns_records["k8s-ns3"]: Refreshing state... [id=5d293ed108e7f10d876bbc434d829fe3]
cloudflare_dns_record.mylabs_dev_ns_records["k8s-ns4"]: Refreshing state... [id=9f16f5c4e98e4074e0a66d2b3b9f702c]
cloudflare_dns_record.mylabs_dev_cname_records[""]: Refreshing state... [id=c68456f8835b3a769e906d23f745d459]
cloudflare_dns_record.mylabs_dev_cname_records["mt-link"]: Refreshing state... [id=fabc8371d3999f4c66f1d1b59795641c]
cloudflare_dns_record.mylabs_dev_cname_records["mt84"]: Refreshing state... [id=e689713d0d2742e6c396e3e7bd09b37f]
cloudflare_dns_record.mylabs_dev_cname_records["rwmt2._domainkey"]: Refreshing state... [id=6d419e9cac4de36af2abb617e685cafe]
cloudflare_dns_record.mylabs_dev_cname_records["rwmt1._domainkey"]: Refreshing state... [id=4e252dd63118ee3da8958c4efc39508a]
cloudflare_dns_record.mylabs_dev_ns_records["aws-ns3"]: Refreshing state... [id=6b6d42a96c7830a32678ec1ad2eb0838]
cloudflare_dns_record.mylabs_dev_ns_records["aws-ns2"]: Refreshing state... [id=2b2957b35e79b08d2ae3b33c3fb65590]
cloudflare_dns_record.mylabs_dev_txt_records["_dmarc"]: Refreshing state... [id=e86f56e20443017085c83b169a7fc673]
uptimerobot_monitor.domain_monitors["linux-old_xvx_cz"]: Refreshing state... [id=801060885]
uptimerobot_monitor.domain_monitors["ruzickovabozena_xvx_cz"]: Refreshing state... [id=801060888]
uptimerobot_monitor.domain_monitors["svatba_xvx_cz"]: Refreshing state... [id=801060882]
uptimerobot_monitor.domain_monitors["petr_xvx_cz"]: Refreshing state... [id=801060892]
uptimerobot_monitor.domain_monitors["ruzicka_dev"]: Refreshing state... [id=801060881]
uptimerobot_monitor.domain_monitors["petr_ruzicka_dev"]: Refreshing state... [id=801060893]
uptimerobot_monitor.domain_monitors["stats_a_xvx_cz"]: Refreshing state... [id=801060895]
cloudflare_zero_trust_list.uptimerobot_ips: Refreshing state... [id=ad2a4ab0-b97b-43aa-916b-b7690e92121f]
uptimerobot_monitor.domain_monitors["www_xvx_cz"]: Refreshing state... [id=801060891]
uptimerobot_monitor.domain_monitors["www_mylabs_dev"]: Refreshing state... [id=801060890]
uptimerobot_monitor.domain_monitors["xvx_cz"]: Refreshing state... [id=801060880]
uptimerobot_monitor.domain_monitors["linux_xvx_cz"]: Refreshing state... [id=801060886]
uptimerobot_monitor.domain_monitors["cestovani_xvx_cz"]: Refreshing state... [id=801060887]
uptimerobot_monitor.domain_monitors["mylabs_dev"]: Refreshing state... [id=801060889]
uptimerobot_monitor.domain_monitors["blog_ruzicka_dev"]: Refreshing state... [id=801060883]
uptimerobot_monitor.domain_monitors["byt_xvx_cz"]: Refreshing state... [id=801060884]
uptimerobot_monitor.domain_monitors["stats-ruzickap-github-io_ruzicka_dev"]: Refreshing state... [id=801060894]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["gate"]: Refreshing state... [id=ea76ae8f-c3a6-456e-8e4a-7e47535bfd60]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["raspi"]: Refreshing state... [id=5c15aae0-7175-43c1-9d05-9198ffe3a577]
uptimerobot_monitor.zero_trust_applications["gate"]: Refreshing state... [id=801060897]
uptimerobot_monitor.zero_trust_applications["prometheus-rpi"]: Refreshing state... [id=801060898]
uptimerobot_monitor.zero_trust_applications["cadvisor-rpi"]: Refreshing state... [id=801060901]
uptimerobot_monitor.zero_trust_applications["kodi-rpi"]: Refreshing state... [id=801060899]
uptimerobot_monitor.zero_trust_applications["uzg-01"]: Refreshing state... [id=801060900]
uptimerobot_monitor.zero_trust_applications["transmission"]: Refreshing state... [id=801060907]
uptimerobot_monitor.zero_trust_applications["esphome-rpi"]: Refreshing state... [id=801060904]
uptimerobot_monitor.zero_trust_applications["grafana-rpi"]: Refreshing state... [id=801060896]
uptimerobot_monitor.zero_trust_applications["hass-rpi"]: Refreshing state... [id=801060902]
uptimerobot_monitor.zero_trust_applications["rpi"]: Refreshing state... [id=801060906]
uptimerobot_monitor.zero_trust_applications["zigbee2mqtt-rpi"]: Refreshing state... [id=801060908]
uptimerobot_monitor.zero_trust_applications["alloy-rpi"]: Refreshing state... [id=801060905]
uptimerobot_monitor.zero_trust_applications["msr-2"]: Refreshing state... [id=801060903]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["gate"]: Refreshing state... [id=ea76ae8f-c3a6-456e-8e4a-7e47535bfd60]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["raspi"]: Refreshing state... [id=5c15aae0-7175-43c1-9d05-9198ffe3a577]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Refreshing state... [id=c872ad2e-c80f-486b-b38d-7f2cecf860a6]
cloudflare_dns_record.cname_zero_trust_tunnel["kodi-rpi.xvx.cz"]: Refreshing state... [id=d7c66f1e1b4ffeaefd2d65ad3883c7b5]
cloudflare_dns_record.cname_zero_trust_tunnel["rpi-ssh.xvx.cz"]: Refreshing state... [id=86bfac0e5b46d507799368bc9295c0e7]
cloudflare_dns_record.cname_zero_trust_tunnel["msr-2.xvx.cz"]: Refreshing state... [id=06827eea52d920921eac677af18810aa]
cloudflare_dns_record.cname_zero_trust_tunnel["grafana-rpi.xvx.cz"]: Refreshing state... [id=403e8278b7e9afb620218018fd6f68b5]
cloudflare_dns_record.cname_zero_trust_tunnel["transmission.xvx.cz"]: Refreshing state... [id=33f8e2054cc6a3e15e1b0ab7ccb14ce3]
cloudflare_dns_record.cname_zero_trust_tunnel["prometheus-rpi.xvx.cz"]: Refreshing state... [id=7562d6ccc0e629a888b568d608be401a]
cloudflare_dns_record.cname_zero_trust_tunnel["uzg-01.xvx.cz"]: Refreshing state... [id=89748e1952e4795756d9caf1e543d792]
cloudflare_dns_record.cname_zero_trust_tunnel["zigbee2mqtt-rpi.xvx.cz"]: Refreshing state... [id=70b9beba69051f2ce7bb77026f1936d1]
cloudflare_dns_record.cname_zero_trust_tunnel["alloy-rpi.xvx.cz"]: Refreshing state... [id=790fd0b5cb7956b51eced909bce019d3]
cloudflare_dns_record.cname_zero_trust_tunnel["cadvisor-rpi.xvx.cz"]: Refreshing state... [id=4a2468d46b5200cdb00aa5ba037b3569]
cloudflare_dns_record.cname_zero_trust_tunnel["gate-ssh.xvx.cz"]: Refreshing state... [id=5f0ab4260c66d10d80e766502fea912a]
cloudflare_dns_record.cname_zero_trust_tunnel["gate.xvx.cz"]: Refreshing state... [id=249e203eaabf50ae7e2642ce2160561b]
cloudflare_dns_record.cname_zero_trust_tunnel["esphome-rpi.xvx.cz"]: Refreshing state... [id=12f31538fad4abfcd8ae57ea6773d588]
cloudflare_dns_record.cname_zero_trust_tunnel["rpi.xvx.cz"]: Refreshing state... [id=fb32687d486ded50d5f52653c10e526c]
cloudflare_dns_record.cname_zero_trust_tunnel["hass-rpi.xvx.cz"]: Refreshing state... [id=3420996168914938f6006962f17e0cc1]
cloudflare_zero_trust_access_application.applications["kodi-rpi"]: Refreshing state... [id=0978a798-f1f8-414c-969c-2d4fa62b4788]
cloudflare_zero_trust_access_application.applications["gate"]: Refreshing state... [id=1b07c21c-b6a3-4cf7-8323-cc0bf3b87366]
cloudflare_zero_trust_access_application.applications["uzg-01"]: Refreshing state... [id=a7b1ecbf-62fa-4d6f-b713-ba872c594db5]
cloudflare_zero_trust_access_application.applications["transmission"]: Refreshing state... [id=e95968d2-f2c6-4e51-81a3-d5159c13befc]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi"]: Refreshing state... [id=23c6339a-1180-4b2d-830b-aa0d49075a3c]
cloudflare_zero_trust_access_application.applications["grafana-rpi"]: Refreshing state... [id=d6021cc8-c8d0-44ad-93df-935e9098c6e8]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"]: Refreshing state... [id=bee8ee72-35aa-4941-b213-68afe733f2b2]
cloudflare_zero_trust_access_application.applications["msr-2"]: Refreshing state... [id=ef69a6bb-e2ed-4919-ba1b-e443d2d25149]
cloudflare_zero_trust_access_application.applications["alloy-rpi"]: Refreshing state... [id=8fde7fd4-42e2-4894-b294-bcc9b9b397d8]
cloudflare_zero_trust_access_application.applications["hass-rpi"]: Refreshing state... [id=5e21c854-67c3-4743-9331-0c26fc142c9e]
cloudflare_zero_trust_access_application.applications["esphome-rpi"]: Refreshing state... [id=3d3c719a-f401-4bd5-a8ce-3269da517a01]
cloudflare_zero_trust_access_application.applications["rpi"]: Refreshing state... [id=c366d9bd-48cc-44cc-bdf2-1d68acc8d6c4]
cloudflare_zero_trust_access_application.applications["prometheus-rpi"]: Refreshing state... [id=49bd24ef-5b6e-4eeb-a911-f4caac54f233]
uptimerobot_psp.all_services: Refreshing state... [id=796650]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_pages_project.ruzickap_github_io will be updated in-place
  ~ resource "cloudflare_pages_project" "ruzickap_github_io" {
      - build_config         = {} -> null
      ~ canonical_deployment = {
          + aliases            = (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-09-24T03:44:21Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  ~ commit_hash    = "bddfccaa64ca00a2e6be3737e4e6def399c55606" -> (known after apply)
                  ~ commit_message = "chore(main): release 1.0.0" -> (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "e93d09c9-8f55-461a-9e5c-17a85d172c23" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-09-24T03:44:24Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-09-24T03:44:24Z" -> (known after apply)
          ~ project_id         = "59418a45-7a28-47bc-9b3a-12d9d882a4f3" -> (known after apply)
          ~ project_name       = "ruzickap-github-io" -> (known after apply)
          ~ short_id           = "e93d09c9" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-09-24T03:44:21Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-09-24T03:44:24Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://e93d09c9.ruzickap-github-io.pages.dev" -> (known after apply)
        } -> (known after apply)
      ~ created_on           = "2025-06-25T13:46:04Z" -> (known after apply)
      - deployment_configs   = {
          - preview    = {
              - compatibility_date  = "2025-06-25" -> null
              - compatibility_flags = [] -> null
            } -> null
          - production = {
              - compatibility_date  = "2025-06-25" -> null
              - compatibility_flags = [] -> null
            } -> null
        } -> null
      ~ domains              = [
          - "ruzickap-github-io.pages.dev",
        ] -> (known after apply)
        id                   = "ruzickap-github-io"
      ~ latest_deployment    = {
          + aliases            = (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-09-24T03:44:21Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  ~ commit_hash    = "bddfccaa64ca00a2e6be3737e4e6def399c55606" -> (known after apply)
                  ~ commit_message = "chore(main): release 1.0.0" -> (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "e93d09c9-8f55-461a-9e5c-17a85d172c23" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-09-24T03:44:24Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-09-24T03:44:24Z" -> (known after apply)
          ~ project_id         = "59418a45-7a28-47bc-9b3a-12d9d882a4f3" -> (known after apply)
          ~ project_name       = "ruzickap-github-io" -> (known after apply)
          ~ short_id           = "e93d09c9" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-09-24T03:44:21Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-09-24T03:44:24Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://e93d09c9.ruzickap-github-io.pages.dev" -> (known after apply)
        } -> (known after apply)
        name                 = "ruzickap-github-io"
      ~ subdomain            = "ruzickap-github-io.pages.dev" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
cloudflare_pages_project.ruzickap_github_io: Modifying... [id=ruzickap-github-io]
cloudflare_pages_project.ruzickap_github_io: Modifications complete after 0s [id=ruzickap-github-io]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"tofu-cloudflare","PRNumber":232,"Program":"tfcmt","SHA1":"594a4d4633fc9fa74416245ee6c3dd11103d2767","Vars":{},"WorkflowName":"tofu-cloudflare"} -->